EEGLLM(
  (eeg_encoder): EEGEncoder(
    (eeg_encoder): CBraMod_Wrapper(
      (cbramod): CBraMod(
        (patch_embedding): PatchEmbedding(
          (positional_encoding): Sequential(
            (0): Conv2d(200, 200, kernel_size=(19, 7), stride=(1, 1), padding=(9, 3), groups=200)
          )
          (proj_in): Sequential(
            (0): Conv2d(1, 25, kernel_size=(1, 49), stride=(1, 25), padding=(0, 24))
            (1): GroupNorm(5, 25, eps=1e-05, affine=True)
            (2): GELU(approximate='none')
            (3): Conv2d(25, 25, kernel_size=(1, 3), stride=(1, 1), padding=(0, 1))
            (4): GroupNorm(5, 25, eps=1e-05, affine=True)
            (5): GELU(approximate='none')
            (6): Conv2d(25, 25, kernel_size=(1, 3), stride=(1, 1), padding=(0, 1))
            (7): GroupNorm(5, 25, eps=1e-05, affine=True)
            (8): GELU(approximate='none')
          )
          (spectral_proj): Sequential(
            (0): Linear(in_features=101, out_features=200, bias=True)
            (1): Dropout(p=0.1, inplace=False)
          )
        )
        (encoder): TransformerEncoder(
          (layers): ModuleList(
            (0-11): 12 x TransformerEncoderLayer(
              (self_attn_s): MultiheadAttention(
                (out_proj): NonDynamicallyQuantizableLinear(in_features=100, out_features=100, bias=True)
              )
              (self_attn_t): MultiheadAttention(
                (out_proj): NonDynamicallyQuantizableLinear(in_features=100, out_features=100, bias=True)
              )
              (linear1): Linear(in_features=200, out_features=800, bias=True)
              (dropout): Dropout(p=0.1, inplace=False)
              (linear2): Linear(in_features=800, out_features=200, bias=True)
              (norm1): LayerNorm((200,), eps=1e-05, elementwise_affine=True)
              (norm2): LayerNorm((200,), eps=1e-05, elementwise_affine=True)
              (dropout1): Dropout(p=0.1, inplace=False)
              (dropout2): Dropout(p=0.1, inplace=False)
            )
          )
        )
        (proj_out): Sequential(
          (0): Linear(in_features=200, out_features=200, bias=True)
        )
      )
      (pool): Sequential(
        (0): AdaptiveAvgPool2d(output_size=(1, 1))
      )
    )
  )
  (llm): Qwen3ForCausalLM(
    (model): Qwen3Model(
      (embed_tokens): Embedding(151936, 2560)
      (layers): ModuleList(
        (0-35): 36 x Qwen3DecoderLayer(
          (self_attn): Qwen3Attention(
            (q_proj): Linear(in_features=2560, out_features=4096, bias=False)
            (k_proj): Linear(in_features=2560, out_features=1024, bias=False)
            (v_proj): Linear(in_features=2560, out_features=1024, bias=False)
            (o_proj): Linear(in_features=4096, out_features=2560, bias=False)
            (q_norm): Qwen3RMSNorm((128,), eps=1e-06)
            (k_norm): Qwen3RMSNorm((128,), eps=1e-06)
          )
          (mlp): Qwen3MLP(
            (gate_proj): Linear(in_features=2560, out_features=9728, bias=False)
            (up_proj): Linear(in_features=2560, out_features=9728, bias=False)
            (down_proj): Linear(in_features=9728, out_features=2560, bias=False)
            (act_fn): SiLU()
          )
          (input_layernorm): Qwen3RMSNorm((2560,), eps=1e-06)
          (post_attention_layernorm): Qwen3RMSNorm((2560,), eps=1e-06)
        )
      )
      (norm): Qwen3RMSNorm((2560,), eps=1e-06)
      (rotary_emb): Qwen3RotaryEmbedding()
    )
    (lm_head): Linear(in_features=2560, out_features=151936, bias=False)
  )
  (projector): SequenceTransformerLinearProjector(
    (pos_enc): PositionalEncoding(
      (dropout): Dropout(p=0.1, inplace=False)
    )
    (transformer): TransformerEncoder(
      (transformer): LinearAttentionTransformer(
        (layers): SequentialSequence(
          (layers): ModuleList(
            (0-1): 2 x ModuleList(
              (0): PreNorm(
                (fn): SelfAttention(
                  (local_attn): LocalAttention(
                    (dropout): Dropout(p=0.2, inplace=False)
                  )
                  (to_q): Linear(in_features=200, out_features=200, bias=False)
                  (to_k): Linear(in_features=200, out_features=200, bias=False)
                  (to_v): Linear(in_features=200, out_features=200, bias=False)
                  (to_out): Linear(in_features=200, out_features=200, bias=True)
                  (dropout): Dropout(p=0.2, inplace=False)
                )
                (norm): LayerNorm((200,), eps=1e-05, elementwise_affine=True)
              )
              (1): PreNorm(
                (fn): Chunk(
                  (fn): FeedForward(
                    (w1): Linear(in_features=200, out_features=800, bias=True)
                    (act): GELU(approximate='none')
                    (dropout): Dropout(p=0.0, inplace=False)
                    (w2): Linear(in_features=800, out_features=200, bias=True)
                  )
                )
                (norm): LayerNorm((200,), eps=1e-05, elementwise_affine=True)
              )
            )
          )
        )
      )
    )
    (proj): Linear(in_features=200, out_features=2560, bias=True)
  )
)